{
  "nav": {
    "home": "Home",
    "projects": "Projects",
    "documents": "Documents",
    "contact": "Contact Me"
  },
  "intro": {
    "avatarAlt": "Lain-Ego's avatar",
    "title": "Hello, I'm Lain",
    "desc": "MCU Development | Linux Development | Mechanical Drawing | PCB Design | ROS & Robot Simulation<br>Focused on embedded systems, robot control and simulation<br>E-mail：lain-ego@qq.com"
  },
  "projects": {
    "title": "My Projects",
    "imgAlt": "Project image",
    "item1": {
      "title": "Portfolio-01 ROBOCON Legged Robot Competition Topic: Quadruped Robot Full-Stack Development",
      "desc": "Plant protection drone-like carbon tube assembly mechanism + force control algorithm + 3D radar mapping and navigation technology."
    },
    "item2": {
      "title": "Portfolio-02 Bionic Boston Lobster Civil Submersible Robot",
      "desc": "Lower computer framework integrating stepper peristaltic pump, motor/servo drive, gyroscope data processing, and closed-loop control of 360-degree servo by reading IIC encoder."
    },
    "item3": {
      "title": "Portfolio-03 Intelligent Transplanting and Harvesting Integrated Robot",
      "desc": "Completed functional debugging of modules such as gripper lifting mechanism, omni-wheel chassis, and omni-directional positioning system by controlling DJI3508 motors."
    },
    "viewDetail": "View details <i class='fas fa-external-link-alt'></i>"
  },

  "project1": {
    "title": "Portfolio-01 ROBOCON Legged Robot Competition Topic: Quadruped Robot Full-Stack Development",
    "imgAlt1": "Project image 1",
    "imgAlt2": "Project image 2",
    "imgAlt3": "Project image 3",
    "imgAlt4": "Project image 4",
    "desc": "As a top competition in the robotics field, ROBOCON has high requirements for mechanical reliability, electrical control stability, and visual accuracy. In the 2025 season, I was basically fully responsible for the full-stack research and development of the legged robot team 1, from mechanical modeling, motion control to autonomous navigation. Adopting plant protection drone-like carbon tube assembly mechanism + force control algorithm + 3D radar mapping and navigation technology, we achieved good results in the 2025 ROBOCON (Jiangyin) legged robot competitions: 30th in the national speed race, 31st in the obstacle race, and 34th in the cross-country race (with more than 180 participating teams in the national competition), winning three second prizes at the national level.",
    "links": {
      "github": "Open Source Code",
      "techDoc": "Technical Documentation",
      "demo": "Demo Video"
    }
  },

  "project2": {
    "title": "Portfolio-02 Bionic Boston Lobster Civil Submersible Robot",
    "imgAlt1": "Project image 1",
    "imgAlt2": "Project image 2",
    "imgAlt3": "Project image 3",
    "imgAlt4": "Project image 4",
    "desc": "This project is a multi-degree-of-freedom lobster underwater robot with controllable buoyancy. In the software part, I was responsible for the development of the control system, designing a lower computer framework integrating stepper peristaltic pump, motor/servo drive, gyroscope data processing, and closed-loop control of 360-degree servo by reading IIC encoder. Meanwhile, I designed a vector propulsion model for special-shaped multi-rotors to improve the omni-directional movement function. In the hardware design part, I was responsible for driver selection, step-down circuit, and waterproof design, etc.<br>The work won the special prize in the underwater robot track of the 2024 Fujian Provincial College Students' Intelligent Marine Equipment Design and Production Competition, and further represented Fujian University of Technology in the 2024 World Maritime Equipment Conference, which was reported by Xinhua News Agency, Guangming Daily and other media.",
    "links": {
      "github": "Open Source Code",
      "techDoc": "Technical Documentation",
      "demo": "Demo Video"
    }
  },

  "project3": {
    "title": "Portfolio-03 Intelligent Transplanting and Harvesting Integrated Robot",
    "imgAlt1": "Project image 1",
    "imgAlt2": "Project image 2",
    "imgAlt3": "Project image 3",
    "imgAlt4": "Project image 4",
    "desc": "Based on the FreeRTOS real-time operating system, the control system for the intelligent integrated transplanting and harvesting agricultural robot was written. By controlling DJI3508 motors, the functional debugging of modules such as the gripper lifting mechanism, omni-wheel chassis, and omni-directional positioning system was completed, ensuring the positioning accuracy of the gripper movement within ±5mm; simultaneously participated in the design of the air circuit system and hardware wiring, supporting collaborative work with another autonomously operating robot to efficiently complete tasks.",
    "links": {
      "github": "Open Source Code",
      "techDoc": "Technical Documentation",
      "demo": "Demo Video"
    }
  },

  "Document01": {
    "title": "MCU Development Document",
    "imgAlt1": "Project Image 1",
    "imgAlt2": "Project Image 2",
    "imgAlt3": "Project Image 3",
    "imgAlt4": "Project Image 4",
    "desc": "See the Feishu link below"
  },

  "Document02": {
    "title": "Linux Development Document",
    "imgAlt1": "Project Image 1",
    "imgAlt2": "Project Image 2",
    "imgAlt3": "Project Image 3",
    "imgAlt4": "Project Image 4",
    "desc": "See the Feishu link below"
  },

  "Document03": {
    "title": "Robotics Document",
    "imgAlt1": "Project Image 1",
    "imgAlt2": "Project Image 2",
    "imgAlt3": "Project Image 3",
    "imgAlt4": "Project Image 4",
    "desc": "See the Feishu link below"
  },

  "contact": {
    "bilibili": "Bilibili",
    "github": "Code Repository",
    "twitter": "Twitter",
    "zhihu": "Zhihu"
  },
  "footer": {
    "copyright": "© 2023-2025 Lain-Ego | Personal Homepage"
  }
}